#define _CRT_SECURE_NO_WARNINGS								/* Говорю что scanf использовать безопасно */
#include <stdio.h>											/* Подключаю стандартные директивы ввода и вывода */
#include <math.h>											/* Подключаю библиотеку с математическими формулами */
#include <Windows.h>										/* Заголовок для досутпа к функциям windows (чтобы управлять кодировкой) */

int main(void)
{
	SetConsoleOutputCP(CP_UTF8);

	double a = 0;															/* Отдельные переменные чтобы не потерять исходные значения сторон треугольника */
	double b = 0;
	double b2, c, a2, a3, h, S;												/* Переменные для промежуточных вычислений и результата программы */


	/* Вывод сообщения для пользователя */
	printf("Задача №18\n");

	char will_repeat = 'Y';

	while (will_repeat == 'Y')
	{
		printf("Вычисление площади равнобедренного треугольника.\n\n");
		printf("Формула:\nS = (a / 2) * sqrt(b * b - a * a / 4)\n\n");

		printf("Введите основание (a): ");										/* Получение значения a */
		scanf("%lf", &a);
		printf("Введите боковую сторону (b): ");								/* Получение значения b */
		scanf("%lf", &b);

		if (a > 0 && b > 0 && a < 2 * b)										/* Условия при которых можно решить задачу */
		{
			printf("\nАлгоритм вычисления:\n\n");

			/* Решаю часть задачи под корнем */
			b2 = b * b;															/* Узнаю чему равен квадрат b */
			printf("1) Вычисление квадрата b:\n");
			printf("b2 = %.2f * %.2f = %.2f\n\n", b, b, b2);

			a2 = a * a;															/* Узнаю чему равен квадрат а */
			printf("2) Вычисление квадрата a:\n");
			printf("a2 = %.2f * %.2f = %.2f\n\n", a, a, a2);

			a3 = a2 / 4;														/* Решаю a*a/4 */
			c = b2 - a3;														/* Узнаю чему равно подкоренное выражение */
			printf("3) Вычисление подкоренного выражения:\n");
			printf("%.2f / 4 = %.2f\n", a2, a3);
			printf("%.2f - %.2f = %.2f\n\n", b2, a3, c);

			h = sqrt(c);														/* Узнаю чему равен квадратный корень - это высота */
			printf("4) Вычисление высоты:\n");
			printf("sqrt (%.2f) = %.2f\n\n", c, h);

			S = 0.5 * a * h;													/* Узнаю площадь */
			printf("5) Вычисление площади:\n");
			printf("0.5 * %.2f * %.2f = % .2f\n\n", a, h, S);

			/* Вывод ответа для пользователя */
			printf("Результаты вчисления: \n");
			printf("Площадь треугольника = %.2f\n\n\n", S);
		}
		else
		{
			printf("\n\nВведёные значения не подходят для решения задачи:\n");
			printf("1) a <= 0 - Основание должно быть больше нуля.\n");
			printf("2) b <= 0 - Боковая сторона должны быть больше нуля.\n");
			printf("a >= 2 * b - Основание должно быть меньше суммы двух боковых сторон.\n\n");
		}
		printf("Повторить вычисления? Y/N\n");
		printf("|>...");
		scanf(" %c", &will_repeat);
	}

	return 0;
}